#include <iostream>
using namespace std; 
/*Завдання 1. Є деякий текст. Використовуючи стандартні
рядкові функції:
■ Порахуйте кількість входжень слова, заданого користувачем;
■ Порахуйте кількість речень у тексті;
■ Кількість точок і ком;
■ Переверніть весь текст цілком;
■ Переверніть кожне речення в тексті. 
*/
int main()
{
	setlocale(0, " ");
	char alphabet1[32] = {'А','Б','В','Г','Ґ','Д','Е','Є','Ж','З','И','І','Ї','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ю','Я'};
	char alphabet2[33] = { 'а','б','в','г','ґ','д','е','є','ж','з','и','і','ї','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ь','ю','я' };


	
	

	
	return 0;
}